app/controllers/sessions_controller.rb

INSERT INTO "users" ("uid", "name", "email") VALUES (?, ?, ?)  [["uid", 1427886623897558], ["name", "Ali Alrawi"], ["email", "red_lin70@yahoo.com"]]
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT 1  [["uid", 1]]
---
  def create
    user = User.find_or_create_by(:uid => auth['uid']) do |u|